import matplotlib.pyplot as plt
import numpy as np

# 定义数据
x = np.array([-14, -13.5, -13, -12, -9, -6, -3, 0, 3, 6, 9, 12, 12.5, 13, 13.5, 14])
B = np.array([0.000425532, 0.000551862, 0.000658245, 0.000831117, 0.001050532, 0.001090426, 0.001097074, 0.001070479, 0.001110372, 0.001103723, 0.000977394, 0.000930851, 0.000871011, 0.000797872, 0.000691489, 0.000605053])

# 绘制图像
plt.plot(x, B, marker='o')

# 添加标题和标签
plt.title('B 随 x 的变化')
plt.xlabel('x/cm')
plt.ylabel('B/kGs')

# 显示网格
plt.grid(True)

# 显示图像
plt.show()
